Revit 2027 API
BuiltInFailures.SketchFailures.InvalidAreaLoadSketch Property
 Area Load has invalid Sketch.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InvalidAreaLoadSketch { get; }
Public Shared ReadOnly Property InvalidAreaLoadSketch As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InvalidAreaLoadSketch {
	FailureDefinitionId^ get ();
}
static member InvalidAreaLoadSketch : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace